<template>
    <div >
        <h1><i class="ni ni-badge"/> 社区问答(CQA)数据的采集与分析</h1>
        
        <div class="row" style="padding:20px">
            <div class="col-6">
                <h4>1.问答社区基本结构</h4>
                <img src="./myimg/cqaArch.png" alt="" style="width:80%;margin-left:10%">
                <p class="description" style="text-align:center">图 问答社区组成示意</p>
                <p>问答社区的发展使问答社区的功能变得丰富，界面更加复杂。如图所示，用户可以在问答社区中自由的提出自己的问题，其他用户如果对该问题感兴趣或者由能力回答该问题，则会为该问题进行解答。同时，用户可以收藏、点赞自己认同的回答或者问题，最终，每个问题的回答，都会有一系列评分不同的回答，作为社区中其他用户对该回答质量的判断。因此目前的问答社区，其包含的实体主要有问题、答案和用户等，实体之间的存在关系主要包括关注关系、赞同关系、提问和回答关系等。在对问答社区的结构进行分析之后，需要继续对社区中的主要实体，继续进行分析，才能对专家推荐任务的完成有所帮助和启发。</p>
                <hr/>
            </div>
            <div class="col-6">
                <h4>2.问答社区的两类不平衡</h4>
                <img src="./myimg/cqaImbalance.png" alt="" style="width:100%;margin-left:0%">
                    <p class="description" style="text-align:center">图 用户和问题的回答数量分布情况</p>
                    <p>（1）问答社区中，对于问题来说，超过75%的问题只有一个或两个回答，少量的问题可以获得三个或者三个以上的回答，也就是说，问答数据缺少“非最佳答案”，这体现了问答社区问答数据类型的不平衡。而为了对专家的回答质量进行多层次的构建，需要为模型输入不同质量的且数量均衡的专家回答。问答数据类型的不平衡影响模型对专家回答质量的表示和判断，显然不利于专家推荐模型的预测效果。因此，需要通过一定的手段，首先克服问答社区专家推荐任务上的问答数据类型不平衡的现象。</p>
                    <p>（2）超过85%的用户只提供了少于100个回答，而社区中回答最多用户甚至贡献答案超过600个。对于专家特征的构建，常采用用户的历史表现，而用户之间回答数量差距巨大，这体现了用户回答历史的不平衡现象。不平衡的用户历史，使模型在构建专家特征上需要考虑克服丰富度带来的影响。并且，对于新问题进行专家推荐，需要实现基于历史数据的训练对未来新问题的推荐预测。历史问答数据中包含回答信息，但是新问题并不包含回答信息，这种训练输入数据与预测输入数据之间的不一致性会影响模型的专家推荐。</p>
                <hr/>
            </div>
        </div>
    </div>
</template>
<script>
export default {
    name: "cqa",
}
</script>